package resp_code

/*
银联应答信息
*/
const (
	UN_00 = "00" // 成功
	UN_A6 = "A6" // 有缺陷的成功
	UN_01 = "01" // 交易失败。详情请咨询95516
	UN_02 = "02" // 系统未开放或暂时关闭，请稍后再试
	UN_03 = "03" // 交易通讯超时，请发起查询交易
	UN_04 = "04" // 订单处理中，请稍后发起查询交易
	UN_05 = "05" // 交易已受理，请稍后查询交易结果
	UN_06 = "06" // 系统繁忙，请稍后再试
	UN_10 = "10" // 报文格式错误
	UN_11 = "11" // 验证签名失败
	UN_12 = "12" // 重复交易，请发起查询交易
	UN_13 = "13" // 报文交易要素缺失
	UN_14 = "14" // 批量文件格式错误
	UN_15 = "15" // 报文交易要素不支持
	UN_30 = "30" // 交易未通过，请尝试使用其他银联卡支付或联系95516
	UN_31 = "31" // 商户状态不正确
	UN_32 = "32" // 无此交易权限
	UN_33 = "33" // 交易金额超限
	UN_34 = "34" // 查无此交易，请稍后发起交易状态查询，若10分钟后查询依旧返回34应答码，则表示原交易失败
	UN_35 = "35" // 原交易不存在或状态不正确
	UN_36 = "36" // 与原交易信息不符
	UN_37 = "37" // 已超过最大查询次数或操作过于频繁
	UN_38 = "38" // 银联风险受限
	UN_39 = "39" // 交易不在受理时间范围内
	UN_40 = "40" // 绑定关系检查失败
	UN_41 = "41" // 批量状态不正确，无法下载
	UN_42 = "42" // 扣款成功但交易超过规定支付时间
	UN_43 = "43" // 无此业务权限，详情请咨询95516
	UN_44 = "44" // 输入号码错误或暂未开通此项业务，详情请咨询95516
	UN_45 = "45" // 原交易已被成功退货或已被成功撤销
	UN_46 = "46" // 交易已被成功冲正
	UN_47 = "47" // 发卡机构Ⅱ、Ⅲ类户日累计或年累计交易限额超限
	UN_48 = "48" // 发卡机构Ⅲ类户账户余额超限
	UN_49 = "49" // 获取云闪付绑定的银行卡失败
	UN_60 = "60" // 交易失败，详情请咨询您的发卡行
	UN_61 = "61" // 输入的卡号无效，请确认后输入
	UN_62 = "62" // 交易失败，发卡银行不支持该商户，请更换其他银行卡
	UN_63 = "63" // 卡状态不正确
	UN_64 = "64" // 卡上的余额不足
	UN_65 = "65" // 输入的密码、有效期或CVN2有误，交  易失败
	UN_66 = "66" // 持卡人身份信息或手机号输入不正确，验证失败
	UN_67 = "67" // 密码输入次数超限
	UN_68 = "68" // 您的银行卡暂不支持该业务，请向您的银行或95516咨询
	UN_69 = "69" // 您的输入超时，交易失败
	UN_70 = "70" // 交易已跳转，等待持卡人输入
	UN_71 = "71" // 动态口令或短信验证码校验失败
	UN_72 = "72" // 您尚未在{}银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通或拨打{}
	UN_73 = "73" // 支付卡已超过有效期
	UN_74 = "74" // 扣款成功，销账未知
	UN_75 = "75" // 扣款成功，销账失败
	UN_76 = "76" // 需要验密开通
	UN_77 = "77" // 银行卡未开通认证支付
	UN_78 = "78" // 发卡行交易权限受限，详情请咨询您的发卡行
	UN_79 = "79" // 此卡可用，但发卡行暂不支持短信验证
	UN_80 = "80" // 交易失败，Token 已过期
	UN_81 = "81" // 月累计交易笔数(金额)超限
	UN_82 = "82" // 需要校验密码
	UN_83 = "83" // 发卡行（渠道）处理中
	UN_85 = "85" // 交易失败，营销规则不满足
	UN_86 = "86" // 二维码状态错误
	UN_87 = "87" // 支付次数超限
	UN_88 = "88" // 无此二维码
	UN_89 = "89" // 无此Token、TR状态无效或者Token状态无效
	UN_90 = "90" // 交易已制单，请至银行页面复核
	UN_91 = "91" // 关闭订单失败，订单交易正在处理
	UN_92 = "92" // 关闭订单失败，订单交易已成功
)

func ErrCodeMsg(code string) string {
	if v, ok := respInfo[code]; ok {
		return v
	}
	return ""
}

var respInfo = map[string]string{
	UN_00: "成功",
	UN_A6: "有缺陷的成功",
	UN_01: "交易失败。详情请咨询95516",
	UN_02: "系统未开放或暂时关闭，请稍后再试",
	UN_03: "交易通讯超时，请发起查询交易",
	UN_04: "订单处理中，请稍后发起查询交易",
	UN_05: "交易已受理，请稍后查询交易结果",
	UN_06: "系统繁忙，请稍后再试",
	UN_10: "报文格式错误",
	UN_11: "验证签名失败",
	UN_12: "重复交易，请发起查询交易",
	UN_13: "报文交易要素缺失",
	UN_14: "批量文件格式错误",
	UN_15: "报文交易要素不支持",
	UN_30: "交易未通过，请尝试使用其他银联卡支付或联系95516",
	UN_31: "商户状态不正确",
	UN_32: "无此交易权限",
	UN_33: "交易金额超限",
	UN_34: "查无此交易，请稍后发起交易状态查询，若10分钟后查询依旧返回34应答码，则表示原交易失败",
	UN_35: "原交易不存在或状态不正确",
	UN_36: "与原交易信息不符",
	UN_37: "已超过最大查询次数或操作过于频繁",
	UN_38: "银联风险受限",
	UN_39: "交易不在受理时间范围内",
	UN_40: "绑定关系检查失败",
	UN_41: "批量状态不正确，无法下载",
	UN_42: "扣款成功但交易超过规定支付时间",
	UN_43: "无此业务权限，详情请咨询95516",
	UN_44: "输入号码错误或暂未开通此项业务，详情请咨询95516",
	UN_45: "原交易已被成功退货或已被成功撤销",
	UN_46: "交易已被成功冲正",
	UN_47: "发卡机构Ⅱ、Ⅲ类户日累计或年累计交易限额超限",
	UN_48: "发卡机构Ⅲ类户账户余额超限",
	UN_49: "获取云闪付绑定的银行卡失败",
	UN_60: "交易失败，详情请咨询您的发卡行",
	UN_61: "输入的卡号无效，请确认后输入",
	UN_62: "交易失败，发卡银行不支持该商户，请更换其他银行卡",
	UN_63: "卡状态不正确",
	UN_64: "卡上的余额不足",
	UN_65: "输入的密码、有效期或CVN2有误，交  易失败",
	UN_66: "持卡人身份信息或手机号输入不正确，验证失败",
	UN_67: "密码输入次数超限",
	UN_68: "您的银行卡暂不支持该业务，请向您的银行或95516咨询",
	UN_69: "您的输入超时，交易失败",
	UN_70: "交易已跳转，等待持卡人输入",
	UN_71: "动态口令或短信验证码校验失败",
	UN_72: "您尚未在{}银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通或拨打{}",
	UN_73: "支付卡已超过有效期",
	UN_74: "扣款成功，销账未知",
	UN_75: "扣款成功，销账失败",
	UN_76: "需要验密开通",
	UN_77: "银行卡未开通认证支付",
	UN_78: "发卡行交易权限受限，详情请咨询您的发卡行",
	UN_79: "此卡可用，但发卡行暂不支持短信验证",
	UN_80: "交易失败，Token 已过期",
	UN_81: "月累计交易笔数(金额)超限",
	UN_82: "需要校验密码",
	UN_83: "发卡行（渠道）处理中",
	UN_85: "交易失败，营销规则不满足",
	UN_86: "二维码状态错误",
	UN_87: "支付次数超限",
	UN_88: "无此二维码",
	UN_89: "无此Token、TR状态无效或者Token状态无效",
	UN_90: "交易已制单，请至银行页面复核",
	UN_91: "关闭订单失败，订单交易正在处理",
	UN_92: "关闭订单失败，订单交易已成功",
}
